In [1]:
from openpyxl import load_workbook
csv_dir = "../data/interim/"

In [ ]:
import pandas as

In [2]:
workbook = load_workbook("../data/raw/online_retail_II.xlsx")
workbook

In [3]:
sheet_names = workbook.sheetnames
sheet_names

['Year 2009-2010', 'Year 2010-2011']

In [4]:
worksheet = workbook["Year 2009-2010"]
worksheet

In [6]:
import csv

In [30]:
import re

csv_name = re.sub("[\s-]","_", sheet_names[0].lower())
csv_name

'year_2009_2010'

In [31]:
# Iterate through each row in the sheet
csv_name = re.sub("[\s-]","_", sheet_names[0].lower())
csv_filename = f"{csv_dir}/{csv_name}.csv"

with open(csv_filename, "w", newline="", encoding="utf-8") as cf:
    writer = csv.writer(cf)
    for row in worksheet.iter_rows(values_only=True):
        writer.writerow(row)

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(csv_filename,encoding="utf-8")
df.head()

NameError: name 'csv_filename' is not defined

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 525461 entries, 0 to 525460
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      525461 non-null  object
 1   StockCode    525461 non-null  object
 2   Description  522533 non-null  object
 3   Quantity     525461 non-null  int64
 4   InvoiceDate  525461 non-null  object
 5   Price        525461 non-null  float64
 6   Customer ID  417534 non-null  float64
 7   Country      525461 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 32.1+ MB

In [3]:
import os

In [4]:
interim_dir = os.path.normpath("../data/interim")
interim_dir

'..\\data\\interim'

In [5]:
import pandas as pd

In [6]:
dataframes = []
for file in os.listdir(interim_dir):
    if file.endswith(".csv"):
        csv_filepath = os.path.join(interim_dir, file)
        df = pd.read_csv(csv_filepath, header=0, encoding="utf-8", parse_dates=["InvoiceDate"])
        dataframes.append(df)
        
online_retail_df = pd.concat(dataframes, ignore_index=True, axis=0)

In [7]:
online_retail_df

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom
...,...,...,...,...,...,...,...,...
1067366,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,2011-12-09 12:50:00,2.10,12680.0,France
1067367,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,2011-12-09 12:50:00,4.15,12680.0,France
1067368,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,2011-12-09 12:50:00,4.15,12680.0,France
1067369,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,2011-12-09 12:50:00,4.95,12680.0,France
1067370,581587,POST,POSTAGE,1,2011-12-09 12:50:00,18.00,12680.0,France

In [8]:
online_retail_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1067371 entries, 0 to 1067370
Data columns (total 8 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   Invoice      1067371 non-null  object
 1   StockCode    1067371 non-null  object
 2   Description  1062989 non-null  object
 3   Quantity     1067371 non-null  int64
 4   InvoiceDate  1067371 non-null  datetime64[ns]
 5   Price        1067371 non-null  float64
 6   Customer ID  824364 non-null   float64
 7   Country      1067371 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 65.1+ MB

In [9]:
online_retail_df["InvoiceDate"]

0         2009-12-01 07:45:00
1         2009-12-01 07:45:00
2         2009-12-01 07:45:00
3         2009-12-01 07:45:00
4         2009-12-01 07:45:00
                  ...
1067366   2011-12-09 12:50:00
1067367   2011-12-09 12:50:00
1067368   2011-12-09 12:50:00
1067369   2011-12-09 12:50:00
1067370   2011-12-09 12:50:00
Name: InvoiceDate, Length: 1067371, dtype: datetime64[ns]

In [10]:
online_retail_df.isnull().sum()

Invoice             0
StockCode           0
Description      4382
Quantity            0
InvoiceDate         0
Price               0
Customer ID    243007
Country             0
dtype: int64

In [40]:
len(online_retail_df)

1067371

In [11]:
online_retail_df["Customer ID"].isnull().sum()

243007

In [49]:
f"{round(243007/1067371, 2):.2%}"

'23.00%'

In [12]:
online_retail_df["Customer ID"].notnull().sum()

824364

In [13]:
(243007/824364) * 100

29.478118889228544

In [14]:
online_retail_df[online_retail_df["Customer ID"].notnull()].isnull().sum()

Invoice        0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
Price          0
Customer ID    0
Country        0
dtype: int64

In [15]:
# drop nulls
online_retail_df_2 = online_retail_df.dropna(axis=0, how="any")

In [16]:
online_retail_df_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 824364 entries, 0 to 1067370
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      824364 non-null  object
 1   StockCode    824364 non-null  object
 2   Description  824364 non-null  object
 3   Quantity     824364 non-null  int64
 4   InvoiceDate  824364 non-null  datetime64[ns]
 5   Price        824364 non-null  float64
 6   Customer ID  824364 non-null  float64
 7   Country      824364 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 56.6+ MB

In [17]:
# remove audit cancellations (cancelled transactions), i.e., those invoices where the "Invoice" value starts with "C"
online_retail_df_3 = online_retail_df_2[~online_retail_df_2["Invoice"].str.startswith("C")]

In [19]:
online_retail_df_3.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom

In [18]:
online_retail_df_3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 805620 entries, 0 to 1067370
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      805620 non-null  object
 1   StockCode    805620 non-null  object
 2   Description  805620 non-null  object
 3   Quantity     805620 non-null  int64
 4   InvoiceDate  805620 non-null  datetime64[ns]
 5   Price        805620 non-null  float64
 6   Customer ID  805620 non-null  float64
 7   Country      805620 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 55.3+ MB

### Split date and time + Change datatypes

In [25]:
online_retail_df_3.loc[:,"invoice_date"] = online_retail_df_3["InvoiceDate"].dt.date
online_retail_df_3.loc[:,"invoice_time"] = online_retail_df_3["InvoiceDate"].dt.time

In [26]:
online_retail_df_3.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,invoice_date,invoice_time
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.95,13085.0,United Kingdom,2009-12-01,07:45:00
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,2009-12-01,07:45:00
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.75,13085.0,United Kingdom,2009-12-01,07:45:00
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.10,13085.0,United Kingdom,2009-12-01,07:45:00
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.25,13085.0,United Kingdom,2009-12-01,07:45:00

In [27]:
online_retail_df_3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 805620 entries, 0 to 1067370
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Invoice       805620 non-null  object
 1   StockCode     805620 non-null  object
 2   Description   805620 non-null  object
 3   Quantity      805620 non-null  int64
 4   InvoiceDate   805620 non-null  datetime64[ns]
 5   Price         805620 non-null  float64
 6   Customer ID   805620 non-null  float64
 7   Country       805620 non-null  object
 8   invoice_date  805620 non-null  object
 9   invoice_time  805620 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(6)
memory usage: 67.6+ MB

In [28]:
online_retail_df_3 = online_retail_df_3.drop(columns="InvoiceDate")
online_retail_df_3.head()

,Invoice,StockCode,Description,Quantity,Price,Customer ID,Country,invoice_date,invoice_time
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,6.95,13085.0,United Kingdom,2009-12-01,07:45:00
1,489434,79323P,PINK CHERRY LIGHTS,12,6.75,13085.0,United Kingdom,2009-12-01,07:45:00
2,489434,79323W,WHITE CHERRY LIGHTS,12,6.75,13085.0,United Kingdom,2009-12-01,07:45:00
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2.10,13085.0,United Kingdom,2009-12-01,07:45:00
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,1.25,13085.0,United Kingdom,2009-12-01,07:45:00

In [29]:

online_retail_df_3 = online_retail_df_3.astype(
    {
        'Invoice': 'int32', 
        'Customer ID': 'int32', 
        'StockCode': 'string', 
        'Description': 'string', 
        'Country': 'string', 
        'invoice_date': 'datetime64[ns]'
    })

In [30]:
online_retail_df_3.head()

,Invoice,StockCode,Description,Quantity,Price,Customer ID,Country,invoice_date,invoice_time
0,489434.0,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,6.95,13085,United Kingdom,2009-12-01,07:45:00
1,489434.0,79323P,PINK CHERRY LIGHTS,12,6.75,13085,United Kingdom,2009-12-01,07:45:00
2,489434.0,79323W,WHITE CHERRY LIGHTS,12,6.75,13085,United Kingdom,2009-12-01,07:45:00
3,489434.0,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2.10,13085,United Kingdom,2009-12-01,07:45:00
4,489434.0,21232,STRAWBERRY CERAMIC TRINKET BOX,24,1.25,13085,United Kingdom,2009-12-01,07:45:00

In [31]:
online_retail_df_3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 805620 entries, 0 to 1067370
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Invoice       805620 non-null  float32
 1   StockCode     805620 non-null  string
 2   Description   805620 non-null  string
 3   Quantity      805620 non-null  int64
 4   Price         805620 non-null  float64
 5   Customer ID   805620 non-null  int32
 6   Country       805620 non-null  string
 7   invoice_date  805620 non-null  datetime64[ns]
 8   invoice_time  805620 non-null  object
dtypes: datetime64[ns](1), float32(1), float64(1), int32(1), int64(1), object(1), string(3)
memory usage: 71.4+ MB

In [32]:
# Rename column 'Invoice' to 'invoice_no'
online_retail_df_3 = online_retail_df_3.rename(
    columns={
        'Invoice': 'invoice_no',
        'StockCode': 'stock_code',
        'Description': 'description',
        'Quantity': 'quantity',
        'Price': 'price',
        'Customer ID': 'customer_id',
        'Country': 'country'
        })

In [33]:
online_retail_df_3.head()

,invoice_no,stock_code,description,quantity,price,customer_id,country,invoice_date,invoice_time
0,489434.0,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,6.95,13085,United Kingdom,2009-12-01,07:45:00
1,489434.0,79323P,PINK CHERRY LIGHTS,12,6.75,13085,United Kingdom,2009-12-01,07:45:00
2,489434.0,79323W,WHITE CHERRY LIGHTS,12,6.75,13085,United Kingdom,2009-12-01,07:45:00
3,489434.0,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2.10,13085,United Kingdom,2009-12-01,07:45:00
4,489434.0,21232,STRAWBERRY CERAMIC TRINKET BOX,24,1.25,13085,United Kingdom,2009-12-01,07:45:00

In [34]:
online_retail_df_3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 805620 entries, 0 to 1067370
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   invoice_no    805620 non-null  float32
 1   stock_code    805620 non-null  string
 2   description   805620 non-null  string
 3   quantity      805620 non-null  int64
 4   price         805620 non-null  float64
 5   customer_id   805620 non-null  int32
 6   country       805620 non-null  string
 7   invoice_date  805620 non-null  datetime64[ns]
 8   invoice_time  805620 non-null  object
dtypes: datetime64[ns](1), float32(1), float64(1), int32(1), int64(1), object(1), string(3)
memory usage: 71.4+ MB

In [38]:
arranged_cols = ['invoice_no', 'stock_code', 'customer_id',
'invoice_date', 'invoice_time', 'description',
'country','quantity', 'price']

online_retail_df_3 = online_retail_df_3.reindex(arranged_cols, axis="columns")

In [39]:
online_retail_df_3.head()

,invoice_no,stock_code,customer_id,invoice_date,invoice_time,description,country,quantity,price
0,489434.0,85048,13085,2009-12-01,07:45:00,15CM CHRISTMAS GLASS BALL 20 LIGHTS,United Kingdom,12,6.95
1,489434.0,79323P,13085,2009-12-01,07:45:00,PINK CHERRY LIGHTS,United Kingdom,12,6.75
2,489434.0,79323W,13085,2009-12-01,07:45:00,WHITE CHERRY LIGHTS,United Kingdom,12,6.75
3,489434.0,22041,13085,2009-12-01,07:45:00,"RECORD FRAME 7"" SINGLE SIZE",United Kingdom,48,2.10
4,489434.0,21232,13085,2009-12-01,07:45:00,STRAWBERRY CERAMIC TRINKET BOX,United Kingdom,24,1.25



#### analysis
- just keep date
- multiply "price" and "quantity" to create "sales_amount"
- remove rows where "sales_amount" is greater than zero
- keep cols: customer_id, sales_amount, price, quantity, invoice_date, country (price and quantity can be removed too)

In [50]:
online_retail_df_3["sales_amount"] = online_retail_df_3["price"] * online_retail_df_3["quantity"]
online_retail_df_3.head()

,invoice_no,stock_code,customer_id,invoice_date,invoice_time,description,country,quantity,price,sales_amount
0,489434.0,85048,13085,2009-12-01,07:45:00,15CM CHRISTMAS GLASS BALL 20 LIGHTS,United Kingdom,12,6.95,83.4
1,489434.0,79323P,13085,2009-12-01,07:45:00,PINK CHERRY LIGHTS,United Kingdom,12,6.75,81.0
2,489434.0,79323W,13085,2009-12-01,07:45:00,WHITE CHERRY LIGHTS,United Kingdom,12,6.75,81.0
3,489434.0,22041,13085,2009-12-01,07:45:00,"RECORD FRAME 7"" SINGLE SIZE",United Kingdom,48,2.10,100.8
4,489434.0,21232,13085,2009-12-01,07:45:00,STRAWBERRY CERAMIC TRINKET BOX,United Kingdom,24,1.25,30.0

In [52]:
online_retail_df_3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 805620 entries, 0 to 1067370
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   invoice_no    805620 non-null  float32
 1   stock_code    805620 non-null  string
 2   customer_id   805620 non-null  int32
 3   invoice_date  805620 non-null  datetime64[ns]
 4   invoice_time  805620 non-null  object
 5   description   805620 non-null  string
 6   country       805620 non-null  string
 7   quantity      805620 non-null  int64
 8   price         805620 non-null  float64
 9   sales_amount  805620 non-null  float64
dtypes: datetime64[ns](1), float32(1), float64(2), int32(1), int64(1), object(1), string(3)
memory usage: 77.6+ MB

In [53]:
analysis_df = online_retail_df_3[online_retail_df_3["sales_amount"]>0]
analysis_df.head()

,invoice_no,stock_code,customer_id,invoice_date,invoice_time,description,country,quantity,price,sales_amount
0,489434.0,85048,13085,2009-12-01,07:45:00,15CM CHRISTMAS GLASS BALL 20 LIGHTS,United Kingdom,12,6.95,83.4
1,489434.0,79323P,13085,2009-12-01,07:45:00,PINK CHERRY LIGHTS,United Kingdom,12,6.75,81.0
2,489434.0,79323W,13085,2009-12-01,07:45:00,WHITE CHERRY LIGHTS,United Kingdom,12,6.75,81.0
3,489434.0,22041,13085,2009-12-01,07:45:00,"RECORD FRAME 7"" SINGLE SIZE",United Kingdom,48,2.10,100.8
4,489434.0,21232,13085,2009-12-01,07:45:00,STRAWBERRY CERAMIC TRINKET BOX,United Kingdom,24,1.25,30.0

In [54]:
analysis_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 805549 entries, 0 to 1067370
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   invoice_no    805549 non-null  float32
 1   stock_code    805549 non-null  string
 2   customer_id   805549 non-null  int32
 3   invoice_date  805549 non-null  datetime64[ns]
 4   invoice_time  805549 non-null  object
 5   description   805549 non-null  string
 6   country       805549 non-null  string
 7   quantity      805549 non-null  int64
 8   price         805549 non-null  float64
 9   sales_amount  805549 non-null  float64
dtypes: datetime64[ns](1), float32(1), float64(2), int32(1), int64(1), object(1), string(3)
memory usage: 61.5+ MB

In [55]:
analysis_df.columns

Index(['invoice_no', 'stock_code', 'customer_id', 'invoice_date',
       'invoice_time', 'description', 'country', 'quantity', 'price',
       'sales_amount'],
      dtype='object')

In [56]:
keep_cols = ['invoice_no', 'customer_id', 'invoice_date', 'country', 'quantity', 'sales_amount']
analysis_df = analysis_df[keep_cols]

In [57]:
analysis_df

,invoice_no,customer_id,invoice_date,country,quantity,sales_amount
0,489434.0,13085,2009-12-01,United Kingdom,12,83.40
1,489434.0,13085,2009-12-01,United Kingdom,12,81.00
2,489434.0,13085,2009-12-01,United Kingdom,12,81.00
3,489434.0,13085,2009-12-01,United Kingdom,48,100.80
4,489434.0,13085,2009-12-01,United Kingdom,24,30.00
...,...,...,...,...,...,...
1067366,581587.0,12680,2011-12-09,France,6,12.60
1067367,581587.0,12680,2011-12-09,France,4,16.60
1067368,581587.0,12680,2011-12-09,France,4,16.60
1067369,581587.0,12680,2011-12-09,France,3,14.85
1067370,581587.0,12680,2011-12-09,France,1,18.00